# 묶인데이터타입 3문제 내고싶은거 있는데 좀 쉽게 - 퀴즈난이도                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   
# 제어문 2문제 어렵게 - 난이도조절

# 1463 , 9095, 10828, 2579, 9012!!@! , 

# # BJ 1463
# A = int(input())
# dp = [0] * (A+1)

# for i in range(2,A+1):
#     dp[i] = dp[i-1]+1

#     if i%2 == 0:
#         dp[i] = min(dp[i],dp[i//2]+1)
#     if i%3 == 0:
#         dp[i] = min(dp[i],dp[i//3]+1)

# print(dp[A])

